#pragma once
#include <shaiya/include/skill/SkillStatusType.h>
#include "include/shaiya/common.h"
#include "include/shaiya/include/CAniListData.h"
#include "include/shaiya/include/CEffectData.h"
#include "include/shaiya/include/CEffectModelList.h"
#include "include/shaiya/include/CInput.h"
#include "include/shaiya/include/CMonsterData.h"
#include "include/shaiya/include/CObjectData.h"
#include "include/shaiya/include/CPlayerData.h"
#include "include/shaiya/include/CTextureList.h"
#include "include/shaiya/include/CWorldMgr.h"
#include "include/shaiya/include/SIMM.h"

namespace shaiya
{
    struct CStaticText;
    struct CSwordEffect;
    struct CVertexShader;

    enum struct HealPointType : UINT8
    {
        Health,
        Stamina,
        Mana
    };

    // notes: code page (see 0x408060)
    // CP_ACP (see winnls.h)
    enum struct LoginVersion : UINT32
    {
        Korea = 1,     //
        China,         //
        Vietnam,       // 65001 (UTF-8)
        Japan,         // 932
        Taiwan,        // 950
        English,       // CP_ACP
        Germany,       // CP_ACP
        SingaMala,     // 950
        HongKong,      //
        France,        // CP_ACP
        Russia,        // CP_ACP
        Turkey,        // 1254
        Brazil,        // CP_ACP
        LatinAmerica,  // CP_ACP
        Poland,        // 1250
        Italy,         // CP_ACP
        Philippines    // CP_ACP
    };

    enum struct TargetType : int
    {
        None = -1,
        Mob,
        Item,
        User,
        Npc
    };

    #pragma pack(push, 1)
    // 00572D30 ctor
    struct Camera
    {
        D3DMATRIX world;            //0x22B69B0  0x00
        D3DMATRIX view;             //0x22B69F0  0x40
        D3DMATRIX projection;       //0x22B6A30  0x80
        D3DVECTOR pos;              //0x22B6A70  0xC0
        D3DVECTOR lookAt;           //0x22B6A7C  0xCC
        D3DVECTOR up;               //0x22B6A88  0xD8
        D3DVECTOR vec1;             //0x22B6A94  0xE4
        D3DVECTOR target;           //0x22B6AA0  0xF0
        D3DMATRIX mat1;             //0x22B6AAC  0xFC
        D3DMATRIX mat2;             //0x22B6AEC  0x13C
        D3DMATRIX mat3;             //0x22B6B2C  0x17C
        D3DMATRIX mat4;             //0x22B6B6C  0x1BC
        D3DMATRIX mat5;             //0x22B6BAC  0x1FC
        // 0x22B6BEC  0x23C
        PAD(260);
        D3DCOLOR fogColor;          //0x22B6CF0  0x340
        PAD(20);
        // 0x22B6D08  0x358
        LPDIRECT3DVERTEXBUFFER9 vertexBuffer1;
        // 0x22B6D0C  0x35C
        LPDIRECT3DVERTEXBUFFER9 vertexBuffer2;
        // 0x22B6D10  0x360
        CVertexShader* vertexShader;
        // 0x22B6D14  0x364
        D3DPRESENT_PARAMETERS presentParameters;
        LPD3DXFONT d3dxFont3;       //0x22B6D4C  0x39C
        LPD3DXFONT d3dxFont2;       //0x22B6D50  0x3A0
        LPD3DXFONT d3dxFont1;       //0x22B6D54  0x3A4
        LPD3DXFONT d3dxFont0;       //0x22B6D58  0x3A8
        HFONT hFont;                //0x22B6D5C  0x3AC
        long text0Width;            //0x22B6D60  0x3B0
        long text1Width;            //0x22B6D64  0x3B4
        long text0Height;           //0x22B6D68  0x3B8
        long text1Height;           //0x22B6D6C  0x3BC
        UINT32 textColorR;          //0x22B6D70  0x3C0
        UINT32 textColorG;          //0x22B6D74  0x3C4
        UINT32 textColorB;          //0x22B6D78  0x3C8
        D3DMATERIAL9 material;      //0x22B6D7C  0x3CC
        LPDIRECT3D9 d3d9;           //0x22B6DC0  0x410
        LPDIRECT3DDEVICE9 device;   //0x22B6DC4  0x414
        UINT32 primitiveCount;      //0x22B6DC8  0x418
        BOOL showInfoText;          //0x22B6DCC  0x41C
        CStaticText* staticText;    //0x22B6DD0  0x420
        PAD(4);
        D3DGAMMARAMP gammaRamp1;    //0x22B6DD8  0x428
        D3DGAMMARAMP gammaRamp2;    //0x22B73D8  0xA28
        LPDIRECTDRAW directDraw;    //0x22B79D8  0x1028
        D3DGAMMARAMP gammaRamp3;    //0x22B79DC  0x102C
        PAD(4);
        D3DCOLOR clearDeviceColor;  //0x22B7FE0  0x1630
        // 0x1634
    };
    #pragma pack(pop)

    static_assert(sizeof(Camera) == 0x1634);

    #pragma pack(push, 1)
    // the .data section
    struct Static
    {
        PAD(212);                            //0x7AB000
        LoginVersion loginVersion;           //0x7AB0D4
        D2D_SIZE_U client;                   //0x7AB0D8
        D3DVIEWPORT9 viewport;               //0x7AB0E0
        // 0x7AB0F8
        PAD(2788);
        // CUser->id, CMob->id, CNpc->id
        ULONG targetId;                      //0x7ABBDC
        TargetType targetType;               //0x7ABBE0
        PAD(24576);
        CMonsterData monMonster;             //0x7B1BE4  monster.mon
        CMonsterData monNpc;                 //0x7B1BF8  npc.mon
        CMonsterData monStrip;               //0x7B1C0C  strip.mon
        CMonsterData monWings;               //0x7B1C20  wing.mon
        // 0x7B1C34
        PAD(284);
        CTextureList textureList;            //0x7B1D50
        CEffectModelList effectModelList;    //0x7B1D68
        // 0x7B1D80
        PAD(59808);
        CharArray<MAX_PATH> iniFileName;     //0x7C0720
        // 0x7C0824
        PAD(1384);
        BOOL enableWaterSurface;             //0x7C0D8C
        BOOL enableShadows;                  //0x7C0D90
        float viewFarthest;                  //0x7C0D94
        float viewNearest;                   //0x7C0D98
        // 0: 16-bit, 1: 32-bit
        UINT32 colorDepth;                   //0x7C0D9C
        float cameraTargetSpeed;             //0x7C0DA0
        float fogNearest;                    //0x7C0DA4
        float fogFarthest;                   //0x7C0DA8
        float fogStart;                      //0x7C0DAC
        float fogEnd;                        //0x7C0DB0
        BOOL disableFog;                     //0x7C0DB4
        float modelFarthest;                 //0x7C0DB8
        float grassFarthest;                 //0x7C0DBC
        // user, npc, mob
        float otherFarthest;                 //0x7C0DC0
        PAD(12);
        CharArray<16> ipv4Addr;              //0x7C0DD0
        // 0x7C0DE0
        PAD(1468);
        HWND hwnd;                           //0x7C139C
        HINSTANCE hinst;                     //0x7C13A0
        BOOL isFullscreenWindow;             //0x7C13A4
        PAD(4);
        BOOL isActiveWindow;                 //0x7C13AC
        PAD(1408);
        UINT32 sysMsgValue2;                 //0x7C1930  <v2>
        HealPointType sysMsgHealPointType1;  //0x7C1934  <up>
        SkillStatusType sysMsgDebuffType;    //0x7C1935  <zz>
        HealPointType sysMsgHealPointType2;  //0x7C1936  <hp>
        PAD(1);
        CharArray<512> sysMsgLapisName;      //0x7C1938  <r>
        CharArray<512> sysMsgTargetName;     //0x7C1B38  <t>
        CharArray<1024> sysMsgBuffer;        //0x7C1D38  <b>
        CharArray<512> sysMsgSkillName;      //0x7C2138  <s>
        CharArray<512> sysMsgPlayerName;     //0x7C2338  <p>
        CharArray<512> sysMsgItemName;       //0x7C2538  <i>
        UINT32 sysMsgValue3;                 //0x7C2738  <v3>
        UINT32 sysMsgValue;                  //0x7C273C  <v>
        CharArray<1024> sysMsgTextBuffer1;   //0x7C2740
        CharArray<1024> sysMsgTextBuffer2;   //0x7C2B40
        CharArray<1024> sysMsgTextBuffer3;   //0x7C2F40
        CharArray<1024> sysMsgTextBuffer4;   //0x7C3340
        CharArray<1024> sysMsgTextBuffer5;   //0x7C3740
        // 0:5 (switches buffers)
        UINT32 sysMsgTextBufferIndex;        //0x7C3B40
        PAD(3868);
        CSwordEffect* seffEventEffect;       //0x7C4A60
        CSwordEffect* seffWeather;           //0x7C4A64
        CWorldMgr worldMgr;                  //0x7C4A68
        CSwordEffect* seffLoginCloud;        //0x906DE0
        CSwordEffect* seffWeapon;            //0x906DE4
        PAD(25576);
        CPlayerData playerData;              //0x90D1D0
        // 0x22B0208
        PAD(6384);
        UINT32 killLv;                       //0x22B1AF8
        UINT32 deathLv;                      //0x22B1AFC
        PAD(2488);
        CInput input;                        //0x22B24B8
        HIMC inputContext;                   //0x22B3F70
        SIMM inputMethodManager;             //0x22B3F74
        // 0x22B3F8C
        PAD(6684);
        CharArrayW<1024> wideCharBuffer1;    //0x22B59A8
        CharArrayW<1024> wideCharBuffer2;    //0x22B61A8
        LPDIRECT3DDEVICE9 device;            //0x22B69A8
        PAD(4);
        Camera camera;                       //0x22B69B0
        // 0x22B7FE4
        PAD(16);
        float fps;                           //0x22B7FF4
        PAD(12816);
        CAniListData humfAction;             //0x22BB208
        CAniListData hummAction;             //0x22BB228
        CAniListData huwfAction;             //0x22BB248
